app/views/users/feed.html.haml

    .col
      - User.find(@user.id).followees.each do |followee|
        - followee.posts.each do |post|
          .d-flex.p-2.border.border-primary.rounded user : #{followee.name} <br> Msg : #{post.msg} <br> Created-at : #{post.created_at} <br> Updated-at : #{post.updated_at}
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 7]]