app/views/users/view_profile.html.haml

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 6]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
    .col
      - User.find(@user.id).posts.each do |post|
        .d-flex.p-2.border.border-primary.rounded Username : #{@profileName} <br> Message : #{post.msg} <br> Created-at : #{post.created_at} <br> Updated-at : #{post.updated_at}

SELECT "follows".* FROM "follows" WHERE "follows"."follower_id" = ? AND "follows"."followee_id" = ? LIMIT ?  [["follower_id", 5], ["followee_id", 6], ["LIMIT", 1]]
---
        .form-actions
          - if Follow.find_by(follower_id: session[:user_id], followee: @user.id) == nil