app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def recieve_login_info
  	@commit = params[:commit]
  	@loginEmail = params[:user][:email]
	@loginPassword = params[:user][:password]
  	if(@commit == 'Login')
		@usermatch = false
		@find = User.find_by(email:@loginEmail)
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "asad"], ["LIMIT", 1]]

  def feed
  	@user = User.find(session[:user_id])
  	@allpost = Array.new
  	User.find(@user.id).followees.each do |followee|
		followee.posts.each do |post|
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 7]]

  def view_profile
	@profileName = params[:name]
	@user = User.find_by(name:@profileName)
	puts(session[:user_id])
	puts(@user.id)
	puts(Follow.find_by(follower_id: session[:user_id], followee: @user.id) == nil)
---
SELECT "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "a"], ["LIMIT", 1]]
SELECT "follows".* FROM "follows" WHERE "follows"."follower_id" = ? AND "follows"."followee_id" = ? LIMIT ?  [["follower_id", 5], ["followee_id", 5], ["LIMIT", 1]]

  def follow_info
	@commit = params[:commit]
  	@follower_id = User.find(session[:user_id]).id
  	@followee_id = params[:follow][:followee_id]
  	if(@commit == 'Follow')
  		f = Follow.create(:follower_id => @follower_id, :followee_id => @followee_id)
  	elsif(@commit == 'Unfollow')
  		Follow.find_by(follower_id: @follower_id, followee: @followee_id).destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
INSERT INTO "follows" ("follower_id", "followee_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["follower_id", 5], ["followee_id", 7], ["created_at", "2021-10-14 05:55:58.241411"], ["updated_at", "2021-10-14 05:55:58.241411"]]
DELETE FROM "follows" WHERE "follows"."id" = ?  [["id", 4]]
SELECT "follows".* FROM "follows" WHERE "follows"."follower_id" = ? AND "follows"."followee_id" = ? LIMIT ?  [["follower_id", 5], ["followee_id", 7], ["LIMIT", 1]]